fixture_rails_root/app/controllers/tenants_controller.rb

SELECT "tenants".* FROM "tenants"
---
  def index
    @tenants = Tenant.all

INSERT INTO "tenants" ("created_at", "name", "subdomain", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 13 Feb 2014 18:32:46 UTC +00:00], ["name", "Customer 1"], ["subdomain", "cust1"], ["updated_at", Thu, 13 Feb 2014 18:32:46 UTC +00:00]]
---
  def create
    @tenant = Tenant.new(tenant_params)

    if @tenant.save

SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_tenant
      @tenant = Tenant.find(params[:id])